Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: དེ་ཉིད་ཡན་ལག་ལས་ཡིན་ཏེ། །རྐྱེན་གྱི་ཡན་ལག་དག་ལ་འཇུག །
en: Its subdivision, [the science of] karma, Is part of the teachings on causation. {17.10}

source: ཇི་ལྟར་སཱ་ལུའི་འབྲུ་རྣམས་ནི། །མྱུ་གུས་རྣམ་པར་ཤེས་པར་བྱེད། །
en: “Just as [the cause in] a grain of rice Can be inferred by the sprout,

source: དེ་བཞིན་གྲུབ་པའི་རྫས་རྣམས་ནི། །མཚན་ཉིད་ཀྱིས་ནི་རྣམ་པར་ཤེས། །
en: So too [the cause in] the power substances Can be inferred by their effects. {17.11}

source: ཇི་ལྟར་ཁ་དོག་དཀར་པོ་ནི། །ཐ་སྙད་ཀྱིས་ནི་རྣམ་པར་བརྟགས། །
en: “Just as the color white Is imputed [to an object] based on a convention,

source: དེ་བཞིན་སྐར་མ་ལྡན་པས་ནི། །ཐ་སྙད་དོན་དུ་རབ་ཏུ་བརྟག །
en: So, too, the astrological influences Are imputed [to a person] based on conventions.

source: ཐམས་ཅད་དུ་ནི་ཐམས་ཅད་ལྡན། །ལས་ནི་གཅིག་པུ་རབ་ཏུ་བསྔགས། །
en: However, it is only karma that is deemed Wholly responsible for all such influences. {17.12}

source: ལས་རྣམས་མེད་པར་མཚོན་པ་མེད། །གང་ན་འང་ལུས་ནི་ཡོད་མ་ཡིན། །
en: “Karma never resides in a body Without being indicated by [certain] signs,

source: རྒྱུ་མཚན་དང་ནི་སྤྱོད་པ་དང་། །སྐྱེ་བ་དང་ནི་རིགས་དང་གནས། །
en: Such as marks, behavioral patterns, or a birth Into a particular category of practitioners. {17.13}

source: རྟག་ཏུ་ལ་ཉེ་སྣ་ཚོགས་པ། །ལས་དེ་ལས་ནི་ཉེ་བར་དམིགས། །
en: “Karma can always be ascertained By various omens.

source: ལས་ནི་གང་དུའང་ལུས་ཅན་མིན། །ནང་ན་གནས་ཤིང་མཚོན་པ་མེད། །
en: Karma never itself possesses a body; It is hidden and can be discerned by other [signs]. {17.14}

source: ཀུན་ནས་སྐྱེ་བོ་རྒས་པ་ན། །རྣམ་པར་འགྱུར་ལས་ཉེ་བར་དམིགས། །
en: “[The condition of] a person thoroughly afflicted by fever Is indicated by the alterations [in their appearance].

source: དེ་བཞིན་ལུས་ལ་བརྟེན་ནས་ནི། །ལས་ནི་ལུས་ཅན་དག་ལ་སྣང་། །
en: In exactly the same way, the karma that resides in the body Of corporeal beings can be observed by them. {17.15}

source: འབྲས་བུ་དགེ་དང་མི་དགེའི་རྟགས། །སྐྱེ་བར་ཡང་ནི་རབ་བརྗོད་དང་། །
en: “The zodiacal birth-horoscopes are widely explained In terms of good or bad [karmic] results.

source: རྣམ་པ་སྣ་ཚོགས་ལ་ཉེ་བཟང་། །ལས་རྣམས་སྣ་ཚོགས་དག་ལས་བྱུང་། །
en: The various omens reflect the various types of karma That beings are produced by. {17.16}

source: དུས་ཚོད་དེ་བཞིན་འགྲོ་བ་དང་། །རྣམ་པ་སྣ་ཚོགས་སྲོག་ཆགས་སྒྲ། །གྲུབ་དང་མ་གྲུབ་མཚན་མ་ནི། །རྐྱེན་གྱི་དོན་ལ་ལྟོས་པ་ཡིན། །
en: “One should always note the time, The [mode of] locomotion, the different voices of beings, The good and bad results . . . . . . . . . . . . . . . . . . {17.17} “To ascertain one’s karma, one should watch For the signs of success or failure.

source: རྒྱུ་མཚན་སྤྱོད་དང་མཚན་མ་ནི། །རྐྱེན་ལ་མངོན་པར་རབ་ཏུ་བརྟག །
en: The telltale signs, the way of acting, and the marks Have been designated as the ascertainment. {17.18}

source: དེ་བས་རྣམ་ཀུན་འབད་ནས་ནི། །རྐྱེན་ལ་རག་ལས་བྱ་བ་ཡིན། །
en: “Therefore, one should take every care When observing [the signs that constitute] the ascertainment.

source: ཟློས་པའི་སྔགས་རྣམས་རྟག་ཏུ་ནི། །གྲུབ་པ་རྒྱུ་ལ་ལྟོས་པ་ཡིན། །
en: If one is a mantra reciter, one should look For the cause of one’s success in the mantra. {17.19}

source: འདི་དག་རྐྱེན་གྱི་ཡན་ལག་ནི། །ལས་ནི་བདག་གིར་བྱེད་པས་མཚོན། །
en: “One should not regard one’s own karma And the karma of others as separate.

source: མི་མཚོན་སྔགས་རྣམས་ཐམས་ཅད་ནི། །བགེགས་ལས་ཤིན་ཏུ་མི་བཟད་འགྱུར། །
en: Terrible and obstructing karmas Could all go undetected.

source: དེ་བས་འདི་དག་ཐམས་ཅད་ཀྱི། །ཡན་ལག་ཏུ་ནི་ཐུབ་པས་གསུངས། །
en: All these branches [of knowledge] are therefore The topic of the Sage ’s teachings. {17.20}

source: ས་དབང་རྒྱལ་པོ་ཐམས་ཅད་མཁྱེན། །བྱང་ཆུབ་སྙིང་པོར་ཏིང་འཛིན་ཐོབ། །
en: “The omniscient Śālendra­rāja Sat upon the seat of awakening

source: སྔགས་ནི་ཡོངས་སུ་གསུངས་པ་ན། །བགེགས་རྣམས་མ་ལུས་རབ་ཏུ་འཇིག །
en: And pronounced the mantra That removes all obstacles,

source: རྨི་ལམ་ངན་དང་མཚན་མ་ངན། །བཟོད་པར་དཀའ་བའང་རྣམ་པར་འཇོམས། །
en: One that removes bad dreams, Bad omens, and difficulties. {17.21}

source: ཀུན་མཁྱེན་བདག་ཉིད་ཆེན་པོ་ཡི། །དེ་ཐུགས་བྱང་ཆུབ་ལ་ཞུགས་པ། །མ་རུངས་བདུད་ཀྱི་སེམས་ཀྱིས་ནི། །བགེགས་ཆེན་འཇིགས་པར་ག་ལ་འགྱུར། །
en: “While the mind of the omniscient great being Was thus steeped in awakening, Māra, with his evil mind, Created very frightening obstacles. {17.22}

source: དེ་ནས་འཇིགས་པ་ཆེན་པོ་ནི། །དེས་ནི་རྒྱུ་མཚན་མེད་པར་སྣང་། །
en: “Śālendra­rāja, [sitting at] the root of the tree, Saw that all this great terror was baseless;

source: རྣམ་པ་སྣ་ཚོགས་འཇིགས་པ་རྣམས། །དེ་ལ་རྒྱུ་མཚན་མེད་པར་འབྱུང་། །
en: The many frightening forms Were, for him, without any basis. {17.23}

source: དེ་ནི་བསོད་ནམས་སྟོབས་བསྐྱེད་པ། །ཡུན་རིང་དུས་སུ་ཡོངས་སུ་བསྔགས། །
en: “Having made aspirations over a long period of time, He accumulated merit and power;

source: དེ་ཡི་སྔགས་ཀྱི་སྟོབས་ཀྱིས་ནི། །དེ་ཚེ་བདུད་ནི་བཅོམ་པར་འགྱུར། །
en: Consequently, by the power of his mantra, Namuci was defeated. {17.24}

source: རྫུ་འཕྲུལ་ལྡན་ཞིང་བརྩོན་འགྲུས་ཆེ། །
en: “Śālendra­rāja is endowed with magical powers and great energy.

source: དེ་ནི་འོད་ཆེན་ལྡན་པར་གྱུར། །
en: Being restrained, he possesses great splendor.

source: དེ་ཡི་སྔགས་ཀྱིས་མཐུ་ཡིས་ནི། །བྱང་ཆུབ་དམ་པ་ཐོབ་པར་གྱུར། །
en: One should strive to obtain the supreme awakening, Using the power of his mantra. {17.25}

source: རྨི་ལམ་ངན་པ་ཉེར་འཇིག་པ། །སྔགས་དེ་འདིར་ནི་བཤད་པར་བྱ། །
en: “This mantra, which obliterates bad omens, Will now by revealed.

source: རྨི་ལམ་ངན་པ་བཟོད་དཀའ་དང་། །མ་རུངས་སེམས་ཅན་ཟློག་བྱེད་པ། །
en: It removes bad dreams and difficulties, And wards off evil beings. {17.26}

source: རྒྱལ་བ་སཱ་ལའི་དབང་པོ་ཡི། །སྔོན་ནི་སྔགས་རྒྱལ་ཡོངས་གསུངས་པ། །ལྷ་ཡི་ཚོགས་དང་གཟའ་རྣམས་དང་། །རྒྱུ་སྐར་སྐར་མཁན་རྣམས་ཉོན་ཅིག །
en: “Please hear it, O hosts of gods; This king of mantras [controls] Planets, constellations, and other celestial entities. It was formerly taught by the victorious Śālendra­rāja. {17.27}

source: གཟའ་དང་རྒྱུ་སྐར་སྐར་མ་རྣམས། །མ་རུངས་ཚར་གཅད་དོན་དང་ནི། །འབྱུང་པོ་རྣམས་ནི་ཐམས་ཅད་ཀྱང་། །ཞི་བའི་སེམས་ནི་རབ་བསྐྱེད་ཕྱིར། །
en: “It is used in order to suppress the wicked Planets, constellations, and stars, And to awaken gentle thoughts In all beings. {17.28}

source: གང་དག་ས་ལ་སྤྱོད་པ་དག །རྐང་མེད་རྐང་མང་དག་དང་ནི། །རྐང་གཉིས་དང་ནི་རྐང་བཞི་དང་། །མདོར་ན་སེམས་ཅན་ཐམས་ཅད་ནི། །འགྲོ་བ་དང་ནི་གནས་པ་ཡི། །འབྱུང་པོའི་ཚོགས་རྣམས་ཀུན་ཉོན་ཅིག །
en: “Please hear it, O hosts of spirits, All of you who roam the earth! Those without legs, with many legs, Or with two or four legs! In short, all the beings and inanimate objects Present in the three worlds. {17.29}

source: ན་མཿསརྦ་བུདྡྷཱ་ནཱཾ། ཨ་པྲ་ཏི་ཧ་ཏ་ཤཱ་ས་ནཱ་ནཱཾ། ཁ་ཁ་ཁཱ་ཧི་ཁཱ་ཧི་ཧཱུྃ་ཧཱུྃ་ཛྭ་ལ་ཛྭ་ལ། པྲ་ཛྭ་ལ་པྲ་ཛྭ་ལ། ཏིཥྛ་ཏིཥྛ་ཥྚི་ཕཊ་ཕཊ་སྭཱ་ཧཱ།
en: “Homage to all the buddhas, the perfect teachers! “ Oṁ, kha kha ! Eat, eat! Huṁ huṁ ! Burn, burn! Blaze, blaze! Remain, remain! Ṣṇīḥ, phaṭ phaṭ, svāhā!

source: གཙུག་ཏོར་འབར་བ་ཞེས་བསྒྲགས་པའི། །སྔགས་འདི་སྔགས་རྣམས་ཀུན་གྱི་མཆོག །གང་ཞིག་ལས་རྣམས་སྟོང་ཕྲག་ནི། །དགུ་བཅུ་རྩ་བཞི་དག་དང་ནི། །བཀྲ་ཤིས་ཐམས་ཅད་འདོད་པ་ཡི། །རྣམ་པ་སྣ་ཚོགས་ལས་རྣམས་བྱེད། །རྨི་ལམ་ངན་དང་མཚན་མ་ངན། །ལན་ཅིག་བཟླས་པས་སེལ་བར་བྱེད། །
en: “This mantra is known by the name of Jvāloṣṇīṣa, Its dazzling white light coming from the Buddha. {17.30} “There are thousands of rites— Eighty, nine and five. One who performs various rites With his thoughts completely attuned to virtue Can destroy bad dreams and omens With a single repetition [of the Jvāloṣṇīṣa]. {17.31}

source: ལས་རྣམས་གཞན་ཡང་བྱེད་པ་ནི། །སྔགས་རྣམས་ཀུན་གྱི་བདག་པོ་ཡིན། །
en: “One may perform other rites, Having mastered all the mantras;

source: འབྱུང་པོ་ཀུན་ལ་དབང་བྱེད་པ། །བླ་མ་མངའ་བདག་སངས་རྒྱས་འདི། །
en: This mantra[, however, the Jvāloṣṇīṣa,] is a buddha, A powerful master who enthralls sentient beings. {17.32}

source: སྔགས་འདི་དྲན་པ་ཙམ་གྱིས་ནི། །སྔགས་རྣམས་མ་ལུས་རབ་ཏུ་སེམས། །རྫོགས་སངས་རྒྱས་པ་ལྷ་ཡི་ལྷ། །
en: “Through merely calling this mantra to mind, All the obstacles will be destroyed, And one will become a perfect buddha superior to the gods.”

source: ཐུབ་མཆོག་གིས་ནི་དེ་གསུངས་ནས
en: Having spoken this, the supreme among sages {17.33}

source: ཡུད་ཙམ་མི་གསུང་བཞུགས་ནས་ནི། །ཅུང་ཟད་དུས་ནི་བཞེས་པར་མཛད། །
en: Remained silent for a while, And looked on.

source: དེ་ཚེ་གནས་གཙང་གནས་པ་ཡི། །ལྷ་ཚོགས་དག་ཀྱང་འདུག་པར་འགྱུར། །
en: The hosts of gods, too, Waited above the Pure Abode. {17.34}

source: ལྷ་རྣམས་གཙོ་བོ་ཐམས་ཅད་ནི། །རྒྱུ་སྐར་གཟའ་དང་སྐར་མ་རྣམས། །གཙུག་ཏོར་སྔགས་ཀྱི་བྱིན་རླབས་ཀྱིས། །འཇིགས་ཤིང་དམ་ཚིག་ལ་གནས་ཕྱིར། །
en: All the chief deities [Who personify] the constellations, planets, and stars, Frightened, took their samaya vows As they were told the mantra of Uṣṇīṣa. {17.35}

source: གཙུག་ཏོར་ཞེས་བྱ་མཐུ་བོ་ཆེ། །མཐུ་མཉམ་མཐུ་ནི་ཆེན་པོ་སྟེ། །
en: The lords called uṣṇīṣa are capable, Very diligent, and of great brilliance.

source: བརྒྱ་ཕྲག་ལྔ་འམ་བཞི་འམ་ནི། །དེ་བཞིན་བདུན་ནམ་བརྒྱད་དང་དགུ། །
en: They are said to be four or five hundred in number, Or seven, eight, ninety, {17.36}

source: གཉིས་དང་དྲུག་དང་ལྔ་དང་བདུན། །གཙུག་ཏོར་དབང་པོར་རབ་ཏུ་བསྒྲགས། །
en: One hundred and twenty, thirty-five, or another — So it has been proclaimed.

source: དེ་ལྟར་གྲངས་དང་གྲངས་མེད་ནི། །གཙུག་ཏོར་རྒྱལ་པོ་དགེ་བ་ཡིན། །
en: The number of these auspicious kings That are born from the [Buddha’s] head is incalculable.

source: དེ་དག་དང་ནི་སྔགས་འདི་མཚུངས། །སྔོན་གྱི་རྒྱལ་བ་རྣམས་ཀྱིས་བཤད། །
en: The aforementioned mantra is identical with them, As explained by the victors in the past. {17.37}

source: འཕགས་པ་འཇམ་དཔལ་གྱི་རྩ་བའི་ཆོ་ག་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཕལ་པོ་ཆེ་ཐེག་པ་ཆེན་པོ་ཤིན་ཏུ་རྒྱས་པའི་མདོ་ལས། ལས་བདག་གིར་བྱས་པའི་རྐྱེན་གྱི་ལེའུ་རབ་འབྱམ་ལས་བཅུ་བདུན་པ་རྫོགས་སོ།། །།
en: This concludes the detailed chapter on the ascertainment of one’s personal karma, seventeenth in “The Root Manual of Noble Mañjuśrī,” an extensive Mahāyāna sūtra that forms a garland-like basket of bodhisattva teachings.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་རྒྱུ་སྐར་དང་གཟའ་དང་སྐར་མ་དང་སྐར་མཁན་ཐམས་ཅད་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་གཏོགས་པ་དང་། ཕྱོགས་ཐམས་ཅད་དུ་རྣམ་པར་གནས་པའི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་ལྡན་པའི་མཆོག་རྣམས་ལ་བཀའ་སྩལ་པ།
en: The blessed Śākyamuni now addressed all the most important grahas among the constellations, planets, stars, and celestial bodies that exist in all the world spheres—the grahas dwelling in all the directions and endowed with great magical powers: {24.1}

source: གྲོགས་པོ་དག་ཁྱེད་ཅག་ཉོན་ཅིག །གཟའ་དང་རྒྱུ་སྐར་ཐམས་ཅད་ཀྱི་མཐུའི་ཚིག་ཁྱེད་ཅག་ཐམས་ཅད་དག་ལ་ཡང་སྟོན་ཅིག །
en: “Listen, venerable friends, to my presentation on the respective powers of all the planets and constellations. Show your power, sirs,

source: ཁྱེད་ཀྱི་སྔགས་བྱ་བའི་དོན་ཐམས་ཅད་ཀྱང་སྒྲུབས་ཤིག །
en: and accomplish the purpose of all the rituals involving the mantra.

source: ཁྱེད་ཀྱིས་དམ་ཚིག་ལ་ཡང་གནས་པར་གྱིས་ཤིག །སྔགས་ཀྱི་རྒྱལ་པོ་འཇམ་པའི་དབྱངས་ཀྱིས་བསྟན་པ་འདི་གྲུབ་ནདེ་ནས་གཞན་ཆོ་གའི་རྒྱལ་པོ་གྲུབ་པ་ལ་ཡང་ཁྱེད་ཅག་ཡིད་དད་པར་གྱིས་ཤིག་ཅེས་སོ། །
en: Keep your samayas and eagerly pursue an accomplishment in the doctrine contained in this sovereign manual of Mañjughoṣa and later expounded in other manuals as well.” {24.2}

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས། གཟའ་རྣམས་ཀྱི་སྤྱོད་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་གསུངས་ཏེ།
en: In the interest of all beings, the blessed Śākyamuni then taught about the action of the grahas.

source: ཟློས་པ་ཐམས་ཅད་ལ་ཕན་པའི་ཕྱིར་དང་སྔགས་ཀྱི་དོན་ཡང་རབ་ཏུ་བསྒྲུབས་པའི་ཕྱིར་ཐམས་ཅད་ཀྱང་ཐམས་ཅད་མཁྱེན་པས་གསུངས་སོ། །
en: He, the omniscient one, taught everything for the benefit of all mantra reciters and in order to fulfill the aims of the mantra [system]. {24.3}

source: ཐ་སྐར་དང་ནི་བྲ་ཉེ་དང་། །སྨིན་དྲུག་དང་པོའི་རྒྱུ་སྐར་ཏེ། །རྒྱུ་སྐར་གསུམ་པོ་འདི་དག་ལ། །མིག་དམར་གཟའ་ནི་བདག་པོ་ཡིན། །
en: “The three nakṣatras, Aśvinī, Bharaṇī, and Kṛttikā, Are ruled by the planet Mars. {24.4}

source: ལུག་ནི་ཁྱིམ་དུ་བསྟན་པ་སྟེ། །འདི་ལ་གྲུབ་པ་ཡོད་མ་ཡིན། །
en: “They are said to belong to the zodiacal sign of Aries, And no accomplishment will arise [when the moon is] in them.

source: གྲུབ་མཆོག་བར་མ་ཐ་མ་ཉིད། །གྲུབ་པ་ཡིན་པར་འདོད་པ་ཡིན། །
en: Accomplishments are classified into The highest, medium, and lowest types.

source: ལས་རྣམས་ཀུན་ཏུའང་མི་འགྲོ་ཞིང་། །མ་རུངས་གཟའ་ནི་རྣམ་པར་ཟློག །
en: One should not embark on any journey Whenever one is obstructed by the cruel planet. {24.5}

source: སྣར་མ་མགོ་དང་དེ་བཞིན་དུ། །ལག་ཏུ་རྒྱུ་སྐར་བརྗོད་པ་ཡིན། །རྒྱུ་སྐར་ནབ་སོ་རྒྱལ་དང་ནི། །སྐག་ཏུའང་རབ་ཏུ་བརྗོད་པ་ཡིན། །
en: “Rohiṇī and Mṛgaśirā, along with Ārdrā, Are said to be nakṣatras too, And so are the celebrated Punarvasus, Puṣya, and Āśleṣā. {24.6}

source: མཆུ་དང་དེ་བཞིན་གྲེ་དང་དབོ། །དེ་བཞིན་མེ་བཞི་ནག་པ་དང་། །ས་རི་ས་ག་ལྷ་མཚམས་དང་། །སྣྲོན་དང་དེ་བཞིན་སྣྲུབས་དང་ནི། །
en: “Further, there are Maghā, the two Phalgunī, As well as Hastā, Citrā, Svāti, Viśākhā, Anurādhā, Jyeṣṭhā, and Mūlā. {24.7}

source: ཆུ་ནི་སྟོད་སྨད་དགེ་བ་སྟེ། །ཟློས་པ་ལ་ཕན་རབ་ཏུ་བསྔགས། །
en: “The two Āṣāḍhās are praised as auspicious And good for mantra reciters.

source: རྒྱུ་སྐར་གྲོ་བཞིན་མོན་གྲུ་ནི། །དྲག་པོའི་ལས་ལ་རབ་ཏུ་བསྔགས། །
en: The nakṣatras of Śravaṇā and Dhaniṣṭhā Are recommended for cruel rites. {24.8}

source: མོན་གྲེ་ཁྲུམས་ནི་སྟོད་སྨད་གཉིས། །རྒྱུ་སྐར་གྲུབ་པའི་རྒྱུ་ཡིན་ནོ། །
en: “Both Śatabhiṣā and the two Bhadrapadās Are conducive to accomplishment.

source: ནམ་གྲུ་ལས་སྐྱེ་དཔལ་དང་ལྡན། །འཐབ་ལ་དགའ་ཞིང་འཇིགས་པ་མེད། །
en: Revatī brings good fortune And also competence and fearlessness in battle. {24.9}

source: རྒྱུ་སྐར་ལྷག་མ་གཙོ་བོ་ནི། །དུས་ཀྱི་ཐ་མར་འབྱུང་བ་མིན། །
en: “The main ones among the remaining nakṣatras Do not occur during the lowest eon.

source: བྱི་བཞིན་ལེགས་པར་སྤྱོད་པ་དང་། །གྲུབ་དང་བསོད་ནམས་རབ་ཏུ་བསྒྲགས། །
en: Abhijit is known to have an auspicious influence And to bring accomplishments and merit.

source: ཉེ་རྒྱལ་དང་ནི་ཐ་ཆུངས་དང་། །འདོད་པ་དག་ནི་ཉིད་ཡིན་ནོ། །
en: Tiṣya is secondary in importance; It is the last and the least significant. {24.10}

source: ཡང་དག་བདེན་དང་འཇིག་རྟེན་དང་། །སྣང་བར་ཡང་ནི་བརྗོད་པ་ཡིན། །
en: “Truth and honesty are praised As the light of the world.

source: ལོངས་སྤྱོད་སྦྱིན་དང་དགེ་སྦྱིན་དང་། །མ་འགགས་པ་དང་འགགས་པ་ཉིད། །
en: [This light] brings happiness and virtue When unobstructed, but can also be obstructed.

source: གྲགས་སྦྱིན་གཟི་བརྗིད་རྒྱལ་པོ་དང་། །དེ་བཞིན་རྒྱལ་པོ་འཇིག་རྟེན་དང་། །
en: It is a majestic king that grants renown, And it is the king of the world. {24.11}

source: རྒྱུ་སྐར་མང་པོ་གསུངས་པ་སྟེ། །སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བཞིའོ། །
en: “Nakṣatras are said to be many— Sixty-four thousand in all.

source: དུས་ཀྱི་ཐ་མ་འདི་ལ་ནི། །འདི་དག་གི་ནི་ནུས་པ་ཡོད། །
en: However, during this lowest eon They do not possess this power.

source: ཆོ་ག་རྒྱལ་འདི་བདེ་དོན་དུ། །དེ་ཙམ་ཤེས་པར་གསུངས་པ་ཡིན། །
en: They are taught in this king of manuals that brings happiness Simply for the sake of information. {24.12}

source: རང་ཉིད་འོད་ལྡན་སེམས་ཅན་ནི། །དེ་ཡི་དུས་སུ་རྫོགས་ལྡན་ཡིན། །
en: “During the golden age, Beings’ powers manifested by themselves.

source: ཐམས་ཅད་ནམ་མཁའ་ལ་འགྲོ་ཞིང་། །རྒ་དང་འཆི་བ་རྣམ་པར་སྤངས། །
en: They all could travel through space And were free from old age and death. {24.13}

source: དེ་ཡི་དུས་སུ་རྒྱུ་སྐར་མེད། །ཉི་མ་ཟླ་བ་སྐར་མ་མེད། །
en: “At that time there were no nakṣatras, No sun or moon, and no stars.

source: ལྷ་དང་ལྷ་མིན་འཇིག་རྟེན་མེད། །དང་པོའི་དུས་ནི་དུས་མཆོག་ཡིན། །
en: During the best of eons at the beginning of time There were no gods and no asuras. {24.14}

source: མིང་མེད་རིགས་ཀྱང་ཡོད་མ་ཡིན། །ཚེས་དང་སྐྱེ་བའི་སྐར་མ་མེད། །
en: “There were no names and no clans; No lunar days and no birth horoscopes;

source: སྨྱུང་བ་མེད་ཅིང་སྔགས་ཀྱང་མེད། །དགེ་དང་མི་དགེའི་ལས་ཀྱང་མེད། །
en: No fasts, no mantras, And no karma, whether good or bad. {24.15}

source: འདི་དག་རང་དགར་སྤྱོད་པ་སྟེ། །བཟའ་དང་བཟའ་བར་བྱ་བའང་མེད། །
en: “Beings could wander as they pleased Without food or eating.

source: འདི་དག་ནད་མེད་དག་པ་སྟེ། །རྟག་ཏུ་སེམས་ཅན་རྣམ་མང་པོ། །
en: They were always Very pure and healthy. {24.16}

source: དེ་ནས་དུས་ནི་བྲི་བ་ན། །འཇིག་རྟེན་སྣོད་མིན་རབ་ཏུ་འཇུག །
en: “However, their consciousness became ‘seized,’ Making them into worldly beings.

source: སྔོན་གྱི་ལས་ཀྱིས་དྲངས་ནས་ནི། །དེ་ནས་ས་ཡི་སྟེང་དུ་འགྲོ། །
en: Drawn by their previous karma They subsequently fell down to earth, {24.17}

source: ས་སྟེང་ལྷ་གནས་གཞལ་མེད་ཁང་། །ལྷ་དང་ལྷ་མིན་ཡང་དག་བྱུང་། །
en: “Where they lived in celestial mansions, Commingling with gods and asuras.

source: བར་མའི་དུས་སུ་ཕྱིན་གྱུར་ནས། །མི་ཡི་ལུས་ལ་ཡང་དག་བརྟེན། །
en: Then, when the middle eon arrived, They took on human bodies. {24.18}

source: བཟའ་དང་བཏུང་ལ་བརྐམ་ཆགས་པས། །འོད་དེ་དག་ནི་རབ་ཏུ་ཉམས། །
en: “Being fond of food and drink, They lost their [physical] luster.

source: ལུས་ནི་སྲ་བ་ཉིད་གྱུར་ཅིང་། །དགེ་དང་མི་དགེ་རྣམ་པར་སྤྱོད། །
en: Their bodies became solid, And their conduct ambivalent—good and bad. {24.19}

source: དེ་ནས་ཉིན་ཞག་ཟླ་བ་དང་། །གཟའ་ཡི་འོད་ནི་བྱུང་བར་གྱུར། །
en: “From then on they became bounded by Days, months, planets, and other celestial bodies.

source: དེ་ནས་བཟུང་ནས་གང་ཅུང་ཟད། །སྐར་མའི་དཔྱད་ཤེས་པ་ཉིད་དང་། །
en: From that time onward, Whatever astrological knowledge there was, {24.20}

source: སེམས་ཅན་རྗེས་སུ་གཟུང་བར་བརྗོད། །ངས་ནི་དེ་དག་བསྟན་པ་ཡིན། །
en: “I taught all of it, showing patience And kindness to sentient beings.

source: སྔོན་ནི་དྲང་སྲོང་ཆ་བྱད་གྱུར། །བློ་ལྡན་ཚངས་པའི་ཆ་བྱད་དང་། །
en: I formerly assumed the appearance of sages, Such as the sagacious Brahmā. {24.21}

source: དབང་ཕྱུག་ཆེན་པོའི་ལུས་བསྟན་ཅིང་། །ཡང་ན་ཁྱབ་འཇུག་ཆ་བྱད་ཀྱིས། །
en: “I took on the body of Maheśvara And also assumed the guise of Viṣṇu.

source: ནམ་མཁའ་ལྡིང་གི་ལུས་སྤྱད་དང་། །གནོད་སྦྱིན་སྲིན་པོ་དྲི་ཟ་དང་། །
en: I used a body of a female garuḍa, And the bodies of yakṣa s, rākṣasas, and gandharvas. {24.22}

source: ཤ་ཟ་དག་གིས་ལུས་ཉིད་གྱུར། །སྐྱེ་དང་སྐྱེ་བར་བདག་ཉིད་སྐྱེས། །
en: “I was born in a body of a female piśāca, And I was born again and again,

source: བྱང་ཆུབ་སེམས་དཔའ་མཁས་པར་ནི། །དེ་དང་དེར་ནི་སྐྱེ་བ་ལ། །
en: Becoming, in these consecutive births, A skillful bodhisattva. {24.23}

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་དོན་ཕྱིར། །རྟག་ཏུ་སྐྱེ་བའི་དབང་གིས་སོ། །བདག་ཉིད་དེ་ཚེ་དུས་དག་ཏུ། །སྔོན་ནི་བྱང་ཆུབ་སེམས་དཔར་གྱུར། །མི་ཤེས་མུན་པས་བསྒྲིབས་པ་ཡི། །བདག་ནི་དེ་ཚེ་བྱིས་པར་གྱུར། །
en: “I was a bodhisattva in the past, During that particular eon, Because of my power to always choose A birth suitable for practicing the conduct of awakening. {24.24} “I also was, in former times, A naive person veiled by the darkness of ignorance.

source: འཇིག་རྟེན་ཇི་སྙེད་ཡོད་པ་ཡི། །ཁྱབ་འཇུག་གིས་བྱས་གཟོ་སྤྱད་དང་། །
en: In this world, however many disciplines of Knowledge, crafts, and occupations there are— {24.25}

source: ལུགས་ཀྱི་བསྟན་བཅོས་སྔོན་གྱི་རབས། །དེ་བཞིན་རིག་བྱེད་བརྡ་སྤྲོད་པ། །སྡེབ་སྦྱོར་སྐར་མའི་དཔྱད་ཉིད་དང་། །རྩིས་དང་སྒྱུ་རྩལ་འདོད་པ་དང་། །ལོག་ཤེས་དེ་བཞིན་ཤེས་པ་དང་། །དེ་བཞིན་ལོག་པར་སྤྱོད་ཉིད་དང་། །
en: “Whatever is found in the scientific treatises, Works on polity, the Purāṇas, the Vedas, works on grammar, Sacred hymns, or works on astrology or arithmetic— All are regarded as conceptual construct, {24.26} “False knowledge, and ignorance, As well as mistaken conduct.

source: འཇིག་རྟེན་བསྟན་བཅོས་ཐམས་ཅད་ནི། །ཡུན་རིང་བདག་གིས་སྔོན་བསྟན་ཏོ། །
en: I formerly recited in this world All the treatises for a long time, {24.27}

source: ཞི་བ་ཐུབ་བདག་ཇི་ལྟ་བར། །ཡེ་ཤེས་བདག་གིས་ཐོབ་མ་ཡིན། །
en: “Yet I found no knowledge whereby I could become a sage who remains at peace—

source: བྱང་ཆུབ་རྒྱུ་ནི་གྲོལ་དོན་དང་། །དེ་བཞིན་དུ་ནི་ཐར་པའི་ཕྱིར། །
en: A knowledge that brings awakening And also constitutes the cause of liberation. {24.28}

source: འཁོར་བའི་བཙོན་རར་རབ་བཅིངས་པས། །ལས་རྣམས་ལས་ཀྱང་བདག་མ་གྲོལ། །ཞི་བ་རྣམ་རྒྱལ་སངས་རྒྱས་ཉིད། །མ་ཉམས་གོ་འཕང་མྱ་ངན་འདས། །
en: “My actions confined me in the prison of saṃsāra, Rather than deliver me into Stainless buddhahood and peaceful nirvāṇa From where there is no falling back. {24.29}

source: ཡུན་རིང་དོན་དུ་མངོན་འདོད་ཅིང་། །ལེགས་པར་ཡོངས་སུ་བཙལ་བས་ཐོབ། །
en: “But now I have attained the perfect awakening That I had desired for so long.

source: དེ་ལྟར་བདག་གིས་རིག་ལྡན་པས། །ཚེགས་ཆུང་བྱ་བས་ཐོབ་པ་ཡིན། །
en: I attained it solely by myself, By applying the rituals as prescribed. {24.30}

source: རྒྱལ་བས་སྔོན་ནི་བསྟན་པས་ན། །རང་བྱུང་ཡེ་ཤེས་ཐོབ་པ་ཡིན། །
en: “I attained the self-arising knowledge That was formerly taught by the victorious ones.

source: དེ་འདྲའི་གནས་ནི་རབ་མཐོང་བ། །ཕྱི་རོལ་ལམ་གྱིས་ཐོབ་མ་ཡིན། །
en: I do not see the state attained By external methods as the same. {24.31}

source: བྱང་ཆུབ་རྒྱུ་ནི་རྙེད་དཀའ་བས། །འཁོར་བའི་དགོན་པར་འཁྱམས་པ་ཡིན། །བདག་གི་རང་བྱུང་འདི་འདྲ་བ། །ཡེ་ཤེས་བདག་གིས་ཐོབ་པ་མིན། །
en: “When lost in the wastelands of saṃsāra Where causes of awakening are difficult to find, I could not obtain knowledge Of the kind that arises by itself. {24.32}

source: རིག་པ་བཟང་པོའི་ལས་དགའ་བས། །ད་ནི་མྱ་ངན་འདས་པ་ཐོབ། །བདག་གིས་བསྟན་བཅོས་འདི་དག་ནི། །བསྡུས་པ་འབའ་ཞིག་བྱས་པ་ཡིན། །
en: “But now, as I have attained nirvāṇa by employing The ritual activity and delighting in what is good, I will teach specifically This collection of topics. {24.33}

source: ལས་ལས་གྲོལ་བ་མེད་པར་ནི། །གྲུབ་པའི་རྒྱུ་ནི་རྙེད་མ་ཡིན། །
en: “Without ritual activity, Causes of accomplishment cannot be won.

source: འཁོར་བའི་ཡུན་རིང་ཞགས་པ་འདིས། །
en: This yarn of saṃsāric existence is very long;

source: ལས་ཀྱི་འཆིང་བས་ངེས་པར་བཅིངས། །
en: It is woven and held together by karma. {24.34}

source: དེ་ཡི་འགྲོ་འདི་བདག་ཉིད་ཆེ། །
en: “This yarn has many destinies [strung along it].

source: དགེ་དང་མི་དགེའང་སྨིན་པར་འགྱུར། །རྒྱུ་སྐར་གཟའ་དང་སྐར་མའི་དཔྱད། །མཚོན་པར་བྱེད་པ་ཁོ་ནར་ཟད། །
en: The nakṣatras, grahas, and other astrological entities Merely indicate the good and bad [results] That are in the process of ripening. {24.35}

source: ཆོས་དང་མི་ལྡན་མི་རྣམས་དང་། །གཞན་ལ་རྟགས་ནི་སྣང་མི་འགྱུར། །
en: “For people not attuned to the Dharma No other signs can be observed [except for the planets and so forth.]

source: དེ་ཉིད་ཀྱིས་ན་གཟའ་གསུངས་པ། །དགེ་དང་མི་དགེའི་རྗེས་གཟུང་ཕྱིར། །
en: Consequently, the planets and other [astrological entities] Are said to fall into the categories of either good or bad. {24.36}

source: འཇིག་རྟེན་སྐྱོང་བ་བཞི་དག་དང་། །ཁམས་ནི་བཞི་པོ་དག་དང་ནི། །ཆུ་དང་ས་དང་རླུང་དང་མེ། །ནམ་མཁར་ཡོངས་སུ་བསྟན་པ་ཡིན། །
en: “The four guardians of the world— Water, earth, wind, and light — Are known to constitute the celestial luminaries.

source: འབྱུང་བ་ཡང་དག་བསྡུ་བའི་ཕྱིར། །འདི་དག་འབྱུང་བ་ཆེན་པོ་ཡིན། །
en: These same [four] great elements Account for [all] the assemblages of elements. {24.37}

source: སེམས་ཅན་ཡང་དག་བསྡུ་བའི་ཕྱིར། །བག་མེད་ལས་ཀྱིས་བྱས་པ་ཡིན། །
en: “Thus they conglomerate to form living beings When stirred to do so by karma.

source: དེ་དག་དུས་ནི་ངེས་པ་ཡིས། །སྔགས་རྣམས་གྲུབ་པར་འགྱུར་བ་ཡིན། །
en: The mantras will be successful Within the limitations of [astrological?] time periods. {24.38}

source: དེ་ཡི་སྐྱེ་བ་འབད་པ་ཡིས། །དགེ་དང་མི་དགེ་བསྲུང་བར་བྱ། །
en: “In these births, one should be protected With great care, in weal and in woe.

source: རང་བཞིན་གྱིས་ནི་འཇིག་རྟེན་གཙོ། །ལྷ་ཡི་དབང་ཕྱུག་བརྒྱ་བྱིན་སོགས། །དེ་ཡང་དེ་ཚེ་དེ་དུས་སུ། །དུས་ཀྱི་མཐར་ནི་ཡོངས་སུ་བརྟགས། །
en: For this task, at the time at the end of the eon, The lords of gods have been assigned. They are Śakra and so forth, Distinguished and eminent in the world. {24.39}

source: དུས་ཀྱི་ཐ་མ་དག་ལ་ནི། །སྔགས་རྣམས་གྲུབ་པ་ངེས་པ་ཡིན། །
en: “The mantras, applied with care, Will produce accomplishments during the lowest eon.

source: དེ་ཉིད་ཀྱིས་ན་ཐུབ་དབང་གིས། །གཞོན་ནུ་ཡོངས་སུ་བརྟགས་པ་ནི། །ཤེས་རབ་ཆེན་པོ་འཇམ་པའི་དབྱངས། །བྱིས་པ་གཞོན་ནུའི་གཟུགས་དང་ལྡན། །
en: Because of this, the victorious ones Appointed the divine youth— {24.40} “Mañjughoṣa of great wisdom, In the form of a young boy.

source: འཇིག་རྟེན་འདིར་ནི་ཀུན་ཏུ་རྒྱུ། །སེམས་ཅན་རྗེས་སུ་གཟུང་བར་བཟོད། །
en: He will wander throughout this entire world, Ready to show kindness to beings. {24.41}

source: དེ་ཡི་དུས་སུ་གྲུབ་པ་ནི། །འཇམ་པའི་དབྱངས་ནི་རབ་ཏུ་མཐོང་། །
en: “At that time achievements pertinent to Mañjughoṣa will be seen—

source: རྒྱུ་སྐར་སྐར་མའི་དཔྱད་ཤེས་པ། །དེ་ཡི་ཚེ་ན་འབྱུང་བར་འགྱུར། །
en: The science of astrology Will come into existence at that time. {24.42}
